In [1]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [3]:
titanic.groupby(['sex', 'class'])['survived'].agg('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [4]:
# 按年龄分割样本
ages = pd.cut(titanic['age'], [0, 18, 60, 99])
ages

0      (18.0, 60.0]
1      (18.0, 60.0]
2      (18.0, 60.0]
3      (18.0, 60.0]
4      (18.0, 60.0]
           ...
886    (18.0, 60.0]
887    (18.0, 60.0]
888             NaN
889    (18.0, 60.0]
890    (18.0, 60.0]
Name: age, Length: 891, dtype: category
Categories (3, interval[int64]): [(0, 18] < (18, 60] < (60, 99]]

In [5]:
# 制作数据透视表
titanic.pivot_table('survived', index=['sex', ages], columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 60]  0.972222  0.900000  0.413793
       (60, 99]  1.000000       NaN  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 60]  0.416667  0.061728  0.136364
       (60, 99]  0.083333  0.333333  0.000000